[
    {
      "title": "Global Markets Rally as Investors Eye Interest Rate Cuts",
      "description": "Stock markets surged worldwide after hints from central banks about potential interest rate reductions later this year.",
      "image_url": "https://source.unsplash.com/random/800x500/?stock-market",
      "pubDate": "2025-05-09"
    },
    {
      "title": "Tech Giants Announce Partnership on AI Ethics",
      "description": "Leading technology companies revealed a joint effort to establish ethical frameworks for the development and use of artificial intelligence.",
      "image_url": "https://source.unsplash.com/random/800x500/?technology",
      "pubDate": "2025-05-08"
    },
    {
      "title": "Record Heatwave Sweeps Across Southern Hemisphere",
      "description": "Cities across the southern hemisphere are experiencing unprecedented temperatures, prompting health warnings and blackouts.",
      "image_url": "https://source.unsplash.com/random/800x500/?climate-change",
      "pubDate": "2025-05-07"
    },
    {
      "title": "Breakthrough in Cancer Research Offers New Hope",
      "description": "Scientists have made a major discovery that could lead to more effective treatments for aggressive forms of cancer.",
      "image_url": "https://source.unsplash.com/random/800x500/?medical",
      "pubDate": "2025-05-06"
    },
    {
      "title": "Olympic Committee Confirms Host City for 2032 Games",
      "description": "After much debate, the International Olympic Committee has selected the host city for the 2032 Summer Olympics.",
      "image_url": "https://source.unsplash.com/random/800x500/?olympics",
      "pubDate": "2025-05-05"
    },
    {
      "title": "Space Mission Discovers Signs of Ancient Water on Mars",
      "description": "NASA's latest rover mission has uncovered mineral deposits that strongly indicate past water activity on Mars.",
      "image_url": "https://source.unsplash.com/random/800x500/?mars",
      "pubDate": "2025-05-04"
    },
    {
      "title": "Government Unveils New Education Policy for 2025",
      "description": "The new education policy aims to promote skill-based learning and improve access to digital tools for all students.",
      "image_url": "https://source.unsplash.com/random/800x500/?education",
      "pubDate": "2025-05-03"
    },
    {
      "title": "Major Cyberattack Hits Global Banks",
      "description": "Financial institutions in multiple countries have reported a coordinated cyberattack targeting customer data.",
      "image_url": "https://source.unsplash.com/random/800x500/?cybersecurity",
      "pubDate": "2025-05-02"
    },
    {
      "title": "New Species of Bird Discovered in Amazon Rainforest",
      "description": "Researchers have discovered a vibrant new species of bird deep within the untouched regions of the Amazon.",
      "image_url": "https://source.unsplash.com/random/800x500/?wildlife",
      "pubDate": "2025-05-01"
    },
    {
      "title": "Electric Vehicle Sales Break Records in Q1 2025",
      "description": "Global EV sales have exceeded expectations in early 2025, showing a strong shift in consumer behavior toward green tech.",
      "image_url": "https://source.unsplash.com/random/800x500/?electric-car",
      "pubDate": "2025-04-30"
    }
  ]
  